test/performance_test/test.yml
config:
  target: "http://localhost:8000/api"  
  phases:
    - duration: 60 
      arrivalRate: 10 

scenarios:
  - flow:
      - get:
          url: "/user/register" 
      - get:
          url: "/user/login"

  - flow:
      - post:
          url: "/classroom"
      - get:
          url: "/classroom" 
      - get:
          url: "/classroom/123"  
      - put:
          url: "/classroom/123"  
      - delete:
          url: "/classroom/123"  

  - flow:
      - post:
          url: "/course" 
      - get:
          url: "/course" 
      - get:
          url: "/course/123"  
      - post:
          url: "/course/assign-faculty"  
      - put:
          url: "/course/123/456"  
      - delete:
          url: "/course/123"  
      - put:
          url: "/course/123" 

  - flow:
      - post:
          url: "/notification"  
      - get:
          url: "/notification"  
      - delete:
          url: "/notification/announcementId"  

  - flow:
      - post:
          url: "/session" 
      - get:
          url: "/session"  
      - get:
          url: "/session/classroom/classRoomId" 
      - get:
          url: "/session/available" 
      - get:
          url: "/session/booked" 
      - put:
          url: "/session/id"  
      - delete:
          url: "/session/id"

  - flow:
      - post:
          url: "/enrollment"  
      - get:
          url: "/enrollment/student/studentId"  
      - get:
          url: "/enrollment/course/courseId" 
      - delete:
          url: "/enrollment/enrollmentId" 

  - flow:
      - post:
          url: "/timetable"  
      - post:
          url: "/timetable/add-session"  
      - get:
          url: "/timetable/course/courseId" 
      - delete:
          url: "/timetable/timetableId/sessionId"  
      - get:
          url: "/timetable/notifications"  
      - delete:
          url: "/timetable/timetableId"